import { ImgBlockType } from '@/shared/types/shared';
import bg from '@/app/assets/background-main.jpg';

export const mainPageBlocks: ImgBlockType[] = [
  {
    img: bg,
    title:
      'Сделайте вход только по приглашениям, чтобы чувствовать себя комфортно',
    paragraph:
      'Серверы SyncTalk делятся на тематические каналы, где можно работать вместе, делиться новостями и просто обсуждать свой день, не переполняя групповой чат.',
  },
  {
    img: bg,
    title: 'Место, где легко общаться',
    paragraph:
      'Начните беседу на канале, когда будете свободны. Друзья с сервера увидят, что вы в сети, и смогут присоединиться к вам. Никаких неудобных звонков!',
  },
  {
    img: bg,
    title: 'От группы до сообщества',
    paragraph:
      'Организуйте жизнь любого сообщества с помощью инструментов модерации и настраиваемых прав доступа для участников. Наделяйте участников особыми преимуществами, создавайте приватные каналы и не только.',
  },
];
